Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_system.h
/**
  ******************************************************************************
  * @file    py32e407_ll_system.h
  * @author  MCU Application Team
  * @brief   Header file of SYSTEM LL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef PY32E407_LL_SYSTEM_H
#define PY32E407_LL_SYSTEM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32e4xx.h"

/** @addtogroup PY32E407_LL_Driver
  * @{
  */

#if defined (FLASH) || defined (SYSCFG) || defined (DBGMCU)

/** @defgroup SYSTEM_LL SYSTEM
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Private_Constants SYSTEM Private Constants
  * @{
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Constants SYSTEM Exported Constants
  * @{
  */

/** @defgroup SYSTEM_LL_EC_REMAP SYSCFG REMAP
  * @{
  */
#define LL_SYSCFG_REMAP_FLASH               0x00000000U                                           /*!< Main Flash memory mapped at 0x00000000 */
#define LL_SYSCFG_REMAP_SYSTEMFLASH         SYSCFG_CFGR1_MEM_MODE_0                               /*!< System Flash memory mapped at 0x00000000 */
#define LL_SYSCFG_REMAP_ESMC                SYSCFG_CFGR1_MEM_MODE_1                               /*!< ESMC mapped at 0x00000000 */
#define LL_SYSCFG_REMAP_SRAM                (SYSCFG_CFGR1_MEM_MODE_1 | SYSCFG_CFGR1_MEM_MODE_0)   /*!< Embedded SRAM mapped at 0x00000000 */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_ETH_PHY_Interface ETH PHY Interface
  * @{
  */
#define LL_SYSCFG_ETH_PHY_MII             0x00000000U
#define LL_SYSCFG_ETH_PHY_RMII            SYSCFG_CFGR1_ETH_PHYSEL
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_I2C_ANF I2C Analog Filter
  * @{
  */
#define LL_SYSCFG_I2C_ANF_PA8            SYSCFG_CFGR1_I2C_EIIC_0
#define LL_SYSCFG_I2C_ANF_PA9            SYSCFG_CFGR1_I2C_EIIC_1
#define LL_SYSCFG_I2C_ANF_PA13           SYSCFG_CFGR1_I2C_EIIC_2
#define LL_SYSCFG_I2C_ANF_PA14           SYSCFG_CFGR1_I2C_EIIC_3
#define LL_SYSCFG_I2C_ANF_PA15           SYSCFG_CFGR1_I2C_EIIC_4
#define LL_SYSCFG_I2C_ANF_PB5            SYSCFG_CFGR1_I2C_EIIC_5
#define LL_SYSCFG_I2C_ANF_PB7            SYSCFG_CFGR1_I2C_EIIC_6
#define LL_SYSCFG_I2C_ANF_PB8            SYSCFG_CFGR1_I2C_EIIC_7
#define LL_SYSCFG_I2C_ANF_PB9            SYSCFG_CFGR1_I2C_EIIC_8
#define LL_SYSCFG_I2C_ANF_PC3            SYSCFG_CFGR1_I2C_EIIC_9
#define LL_SYSCFG_I2C_ANF_PC6            SYSCFG_CFGR1_I2C_EIIC_10
#define LL_SYSCFG_I2C_ANF_PC7            SYSCFG_CFGR1_I2C_EIIC_11
#define LL_SYSCFG_I2C_ANF_PC8            SYSCFG_CFGR1_I2C_EIIC_12
#define LL_SYSCFG_I2C_ANF_PC9            SYSCFG_CFGR1_I2C_EIIC_13
#define LL_SYSCFG_I2C_ANF_PC11           SYSCFG_CFGR1_I2C_EIIC_14
#define LL_SYSCFG_I2C_ANF_PF0            SYSCFG_CFGR1_I2C_EIIC_15
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_TIM2_INTERNAL_TRIGGER1_REMAP TIM2 internal trigger1 remap
  * @{
  */
#define LL_SYSCFG_TIM2_INTERNAL_TRIGGER1_NONE          0x00000000U
#define LL_SYSCFG_TIM2_INTERNAL_TRIGGER1_USB1_SOF      SYSCFG_CFGR1_TIM2ITR1_REMAP_0  /*!< TIM2ITR1 remaps to USB1_SOF */
#define LL_SYSCFG_TIM2_INTERNAL_TRIGGER1_USB2_SOF      SYSCFG_CFGR1_TIM2ITR1_REMAP_1  /*!< TIM2ITR1 remaps to USB2_SOF */
#define LL_SYSCFG_TIM2_INTERNAL_TRIGGER1_ETH_PTP_INTR  SYSCFG_CFGR1_TIM2ITR1_REMAP    /*!< TIM2ITR1 remaps to ETH_PTP_INTR */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_CTC_SOF_FROM SYSCFG CTC SOF FROM
  * @{
  */
#define LL_SYSCFG_CTC_SOF_FROM_USB1    0x00000000U              /*!< USB SOF for configuring CTC comes from USB1 */
#define LL_SYSCFG_CTC_SOF_FROM_USB2    SYSCFG_CFGR1_CTC_SOF_SEL /*!< USB SOF for configuring CTC comes from USB2 */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_I2C_FASTMODEPLUS SYSCFG I2C FASTMODEPLUS
  * @{
  */
#define LL_SYSCFG_I2C_FASTMODEPLUS_I2C1    SYSCFG_CFGR1_I2C1_FMP /*!< Enable I2C1 Fast mode Plus  */
#define LL_SYSCFG_I2C_FASTMODEPLUS_I2C2    SYSCFG_CFGR1_I2C2_FMP /*!< Enable I2C2 Fast mode plus  */
#define LL_SYSCFG_I2C_FASTMODEPLUS_I2C3    SYSCFG_CFGR1_I2C3_FMP /*!< Enable I2C3 Fast mode Plus  */
#define LL_SYSCFG_I2C_FASTMODEPLUS_I2C4    SYSCFG_CFGR1_I2C4_FMP /*!< Enable I2C4 Fast mode plus  */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_TIMBREAK TIMER BREAK INPUT
  * @{
  */
#if defined(SYSCFG_CFGR2_CLL)
#define LL_SYSCFG_TIMBREAK_LOCKUP       SYSCFG_CFGR2_CLL
#endif
#if defined(SYSCFG_CFGR2_SPL)
#define LL_SYSCFG_TIMBREAK_SRAM_PARITY  SYSCFG_CFGR2_SPL
#endif
#if defined(SYSCFG_CFGR2_PVDL)
#define LL_SYSCFG_TIMBREAK_PVD          SYSCFG_CFGR2_PVDL
#endif
#if defined(SYSCFG_CFGR2_ECCL)
#define LL_SYSCFG_TIMBREAK_ECC          SYSCFG_CFGR2_ECCL
#endif
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_EXTI_PORT EXTI PORT
  * @{
  */
#define LL_SYSCFG_EXTI_PORTA            0U   /*!< EXTI PORT A */
#define LL_SYSCFG_EXTI_PORTB            1U   /*!< EXTI PORT B */
#define LL_SYSCFG_EXTI_PORTC            2U   /*!< EXTI PORT C */
#define LL_SYSCFG_EXTI_PORTD            3U   /*!< EXTI PORT D */
#define LL_SYSCFG_EXTI_PORTE            4U   /*!< EXTI PORT E */
#define LL_SYSCFG_EXTI_PORTF            5U   /*!< EXTI PORT F */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_EXTI_LINE EXTI LINE
  * @{
  */
#define LL_SYSCFG_EXTI_LINE0            (0x000FU << 16U | 0U)  /*!< EXTI_POSITION_0  | EXTICR[0] */
#define LL_SYSCFG_EXTI_LINE1            (0x00F0U << 16U | 0U)  /*!< EXTI_POSITION_4  | EXTICR[0] */
#define LL_SYSCFG_EXTI_LINE2            (0x0F00U << 16U | 0U)  /*!< EXTI_POSITION_8  | EXTICR[0] */
#define LL_SYSCFG_EXTI_LINE3            (0xF000U << 16U | 0U)  /*!< EXTI_POSITION_12 | EXTICR[0] */
#define LL_SYSCFG_EXTI_LINE4            (0x000FU << 16U | 1U)  /*!< EXTI_POSITION_0  | EXTICR[1] */
#define LL_SYSCFG_EXTI_LINE5            (0x00F0U << 16U | 1U)  /*!< EXTI_POSITION_4  | EXTICR[1] */
#define LL_SYSCFG_EXTI_LINE6            (0x0F00U << 16U | 1U)  /*!< EXTI_POSITION_8  | EXTICR[1] */
#define LL_SYSCFG_EXTI_LINE7            (0xF000U << 16U | 1U)  /*!< EXTI_POSITION_12 | EXTICR[1] */
#define LL_SYSCFG_EXTI_LINE8            (0x000FU << 16U | 2U)  /*!< EXTI_POSITION_0  | EXTICR[2] */
#define LL_SYSCFG_EXTI_LINE9            (0x00F0U << 16U | 2U)  /*!< EXTI_POSITION_4  | EXTICR[2] */
#define LL_SYSCFG_EXTI_LINE10           (0x0F00U << 16U | 2U)  /*!< EXTI_POSITION_8  | EXTICR[2] */
#define LL_SYSCFG_EXTI_LINE11           (0xF000U << 16U | 2U)  /*!< EXTI_POSITION_12 | EXTICR[2] */
#define LL_SYSCFG_EXTI_LINE12           (0x000FU << 16U | 3U)  /*!< EXTI_POSITION_0  | EXTICR[3] */
#define LL_SYSCFG_EXTI_LINE13           (0x00F0U << 16U | 3U)  /*!< EXTI_POSITION_4  | EXTICR[3] */
#define LL_SYSCFG_EXTI_LINE14           (0x0F00U << 16U | 3U)  /*!< EXTI_POSITION_8  | EXTICR[3] */
#define LL_SYSCFG_EXTI_LINE15           (0xF000U << 16U | 3U)  /*!< EXTI_POSITION_12 | EXTICR[3] */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_GPIO_PORT GPIO PORT
  * @{
  */
#define LL_SYSCFG_GPIO_PORTA              0x00000000U
#define LL_SYSCFG_GPIO_PORTB              0x00000001U
#define LL_SYSCFG_GPIO_PORTC              0x00000002U
#define LL_SYSCFG_GPIO_PORTD              0x00000003U
#define LL_SYSCFG_GPIO_PORTE              0x00000004U
#define LL_SYSCFG_GPIO_PORTF              0x00000005U
/**
  * @}
  */
  
/** @defgroup SYSTEM_LL_EC_GPIO_PIN GPIO PIN
  * @{
  */
#define LL_SYSCFG_GPIO_PIN_0              0x00000001U
#define LL_SYSCFG_GPIO_PIN_1              0x00000002U
#define LL_SYSCFG_GPIO_PIN_2              0x00000004U
#define LL_SYSCFG_GPIO_PIN_3              0x00000008U
#define LL_SYSCFG_GPIO_PIN_4              0x00000010U
#define LL_SYSCFG_GPIO_PIN_5              0x00000020U
#define LL_SYSCFG_GPIO_PIN_6              0x00000040U
#define LL_SYSCFG_GPIO_PIN_7              0x00000080U
#define LL_SYSCFG_GPIO_PIN_8              0x00000100U
#define LL_SYSCFG_GPIO_PIN_9              0x00000200U
#define LL_SYSCFG_GPIO_PIN_10             0x00000400U
#define LL_SYSCFG_GPIO_PIN_11             0x00000800U
#define LL_SYSCFG_GPIO_PIN_12             0x00001000U
#define LL_SYSCFG_GPIO_PIN_13             0x00002000U
#define LL_SYSCFG_GPIO_PIN_14             0x00004000U
#define LL_SYSCFG_GPIO_PIN_15             0x00008000U
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_GPIO_ANA2 GPIO Enable Analog2 Mode
  * @{
  */
#define LL_SYSCFG_GPIOA_PIN_0                    SYSCFG_PAANA2ENR_PA0_ENA2
#define LL_SYSCFG_GPIOA_PIN_1                    SYSCFG_PAANA2ENR_PA1_ENA2
#define LL_SYSCFG_GPIOA_PIN_2                    SYSCFG_PAANA2ENR_PA2_ENA2
#define LL_SYSCFG_GPIOA_PIN_3                    SYSCFG_PAANA2ENR_PA3_ENA2
#define LL_SYSCFG_GPIOA_PIN_4                    SYSCFG_PAANA2ENR_PA4_ENA2
#define LL_SYSCFG_GPIOA_PIN_5                    SYSCFG_PAANA2ENR_PA5_ENA2
#define LL_SYSCFG_GPIOA_PIN_7                    SYSCFG_PAANA2ENR_PA7_ENA2
#define LL_SYSCFG_GPIOA_PIN_10                   SYSCFG_PAANA2ENR_PA10_ENA2

#define LL_SYSCFG_GPIOB_PIN_0                    SYSCFG_PBANA2ENR_PB0_ENA2
#define LL_SYSCFG_GPIOB_PIN_1                    SYSCFG_PBANA2ENR_PB1_ENA2
#define LL_SYSCFG_GPIOB_PIN_2                    SYSCFG_PBANA2ENR_PB2_ENA2

#define LL_SYSCFG_GPIOC_PIN_0                    SYSCFG_PCANA2ENR_PC0_ENA2
#define LL_SYSCFG_GPIOC_PIN_1                    SYSCFG_PCANA2ENR_PC1_ENA2
#define LL_SYSCFG_GPIOC_PIN_2                    SYSCFG_PCANA2ENR_PC2_ENA2
#define LL_SYSCFG_GPIOC_PIN_3                    SYSCFG_PCANA2ENR_PC3_ENA2
#define LL_SYSCFG_GPIOC_PIN_14                   SYSCFG_PCANA2ENR_PC14_ENA2
#define LL_SYSCFG_GPIOC_PIN_15                   SYSCFG_PCANA2ENR_PC15_ENA2

#define LL_SYSCFG_GPIOD_PIN_10                   SYSCFG_PDANA2ENR_PD10_ENA2
#define LL_SYSCFG_GPIOD_PIN_11                   SYSCFG_PDANA2ENR_PD11_ENA2
#define LL_SYSCFG_GPIOD_PIN_12                   SYSCFG_PDANA2ENR_PD12_ENA2
#define LL_SYSCFG_GPIOD_PIN_13                   SYSCFG_PDANA2ENR_PD13_ENA2

#define LL_SYSCFG_GPIOE_PIN_7                    SYSCFG_PEANA2ENR_PE7_ENA2
#define LL_SYSCFG_GPIOE_PIN_10                   SYSCFG_PEANA2ENR_PE10_ENA2
#define LL_SYSCFG_GPIOE_PIN_11                   SYSCFG_PEANA2ENR_PE11_ENA2
#define LL_SYSCFG_GPIOE_PIN_12                   SYSCFG_PEANA2ENR_PE12_ENA2
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_CCMSRAMWRP CCM Write protection
  * @{
  */
#define LL_SYSCFG_CCMSRAMWRP_PAGE0          SYSCFG_SWPR_P0WP  /*!< CCMSRAM Write protection page 0 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE1          SYSCFG_SWPR_P1WP  /*!< CCMSRAM Write protection page 1 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE2          SYSCFG_SWPR_P2WP  /*!< CCMSRAM Write protection page 2 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE3          SYSCFG_SWPR_P3WP  /*!< CCMSRAM Write protection page 3 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE4          SYSCFG_SWPR_P4WP  /*!< CCMSRAM Write protection page 4 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE5          SYSCFG_SWPR_P5WP  /*!< CCMSRAM Write protection page 5 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE6          SYSCFG_SWPR_P6WP  /*!< CCMSRAM Write protection page 6 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE7          SYSCFG_SWPR_P7WP  /*!< CCMSRAM Write protection page 7 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE8          SYSCFG_SWPR_P8WP  /*!< CCMSRAM Write protection page 8 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE9          SYSCFG_SWPR_P9WP  /*!< CCMSRAM Write protection page 9 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE10         SYSCFG_SWPR_P10WP /*!< CCMSRAM Write protection page 10 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE11         SYSCFG_SWPR_P11WP /*!< CCMSRAM Write protection page 11 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE12         SYSCFG_SWPR_P12WP /*!< CCMSRAM Write protection page 12 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE13         SYSCFG_SWPR_P13WP /*!< CCMSRAM Write protection page 13 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE14         SYSCFG_SWPR_P14WP /*!< CCMSRAM Write protection page 14 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE15         SYSCFG_SWPR_P15WP /*!< CCMSRAM Write protection page 15 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE16         SYSCFG_SWPR_P16WP /*!< CCMSRAM Write protection page 16 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE17         SYSCFG_SWPR_P17WP /*!< CCMSRAM Write protection page 17 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE18         SYSCFG_SWPR_P18WP /*!< CCMSRAM Write protection page 18 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE19         SYSCFG_SWPR_P19WP /*!< CCMSRAM Write protection page 19 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE20         SYSCFG_SWPR_P20WP /*!< CCMSRAM Write protection page 20 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE21         SYSCFG_SWPR_P21WP /*!< CCMSRAM Write protection page 21 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE22         SYSCFG_SWPR_P22WP /*!< CCMSRAM Write protection page 22 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE23         SYSCFG_SWPR_P23WP /*!< CCMSRAM Write protection page 23 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE24         SYSCFG_SWPR_P24WP /*!< CCMSRAM Write protection page 24 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE25         SYSCFG_SWPR_P25WP /*!< CCMSRAM Write protection page 25 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE26         SYSCFG_SWPR_P26WP /*!< CCMSRAM Write protection page 26 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE27         SYSCFG_SWPR_P27WP /*!< CCMSRAM Write protection page 27 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE28         SYSCFG_SWPR_P28WP /*!< CCMSRAM Write protection page 28 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE29         SYSCFG_SWPR_P29WP /*!< CCMSRAM Write protection page 29 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE30         SYSCFG_SWPR_P30WP /*!< CCMSRAM Write protection page 30 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE31         SYSCFG_SWPR_P31WP /*!< CCMSRAM Write protection page 31 */

/**
  * @}
  */

