Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_system.h
/** @defgroup SYSTEM_LL_EC_LATENCY FLASH LATENCY
  * @{
  */
#define LL_FLASH_LATENCY_0                 0x00000000UL                                                        /*!< FLASH Zero wait state */
#define LL_FLASH_LATENCY_1                 FLASH_ACR_LATENCY_0                                                 /*!< FLASH One wait state */
#define LL_FLASH_LATENCY_3                 (FLASH_ACR_LATENCY_0 | FLASH_ACR_LATENCY_1)                         /*!< FLASH Three wait state */
#define LL_FLASH_LATENCY_4                 FLASH_ACR_LATENCY_2                                                 /*!< FLASH Four wait state */
#define LL_FLASH_LATENCY_5                 (FLASH_ACR_LATENCY_0 | FLASH_ACR_LATENCY_2)                         /*!< FLASH Five wait state */
#define LL_FLASH_LATENCY_6                 (FLASH_ACR_LATENCY_1 | FLASH_ACR_LATENCY_2)                         /*!< FLASH Six wait state */
#define LL_FLASH_LATENCY_7                 (FLASH_ACR_LATENCY_0 | FLASH_ACR_LATENCY_1 | FLASH_ACR_LATENCY_2)   /*!< FLASH Seven wait state */
/**
  * @}
  */
  
/** @defgroup SYSTEM_LL_EC_STOP_IP  DBGMCU STOP IP
  * @{
  */
#if defined(DBGMCU_CR1_DBG_IWDG_STOP)
#define LL_DBGMCU_IWDG_STOP                  DBGMCU_CR1_DBG_IWDG_STOP
#endif

#if defined(DBGMCU_CR1_DBG_WWDG_STOP)
#define LL_DBGMCU_WWDG_STOP                  DBGMCU_CR1_DBG_WWDG_STOP
#endif

#if defined(DBGMCU_CR1_DBG_TIM1_STOP)
#define LL_DBGMCU_TIM1_STOP                  DBGMCU_CR1_DBG_TIM1_STOP
#endif

#if defined(DBGMCU_CR1_DBG_TIM2_STOP)
#define LL_DBGMCU_TIM2_STOP                  DBGMCU_CR1_DBG_TIM2_STOP
#endif

#if defined(DBGMCU_CR1_DBG_TIM3_STOP)
#define LL_DBGMCU_TIM3_STOP                  DBGMCU_CR1_DBG_TIM3_STOP
#endif

#if defined(DBGMCU_CR1_DBG_TIM4_STOP)
#define LL_DBGMCU_TIM4_STOP                  DBGMCU_CR1_DBG_TIM4_STOP
#endif

#if defined(DBGMCU_CR1_DBG_CAN1_STOP)
#define LL_DBGMCU_CAN1_STOP                  DBGMCU_CR1_DBG_CAN1_STOP
#endif

#if defined(DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT)
#define LL_DBGMCU_I2C1_SMBUS_TIMEOUT         DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT
#endif

#if defined(DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT)
#define LL_DBGMCU_I2C2_SMBUS_TIMEOUT         DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT
#endif

#if defined(DBGMCU_CR1_DBG_TIM5_STOP)
#define LL_DBGMCU_TIM5_STOP                  DBGMCU_CR1_DBG_TIM5_STOP
#endif

#if defined(DBGMCU_CR1_DBG_TIM6_STOP)
#define LL_DBGMCU_TIM6_STOP                  DBGMCU_CR1_DBG_TIM6_STOP
#endif

#if defined(DBGMCU_CR1_DBG_TIM7_STOP)
#define LL_DBGMCU_TIM7_STOP                  DBGMCU_CR1_DBG_TIM7_STOP
#endif

#if defined(DBGMCU_CR1_DBG_TIM8_STOP)
#define LL_DBGMCU_TIM8_STOP                  DBGMCU_CR1_DBG_TIM8_STOP
#endif

#if defined(DBGMCU_CR1_DBG_TIM9_STOP)
#define LL_DBGMCU_TIM9_STOP                  DBGMCU_CR1_DBG_TIM9_STOP
#endif

#if defined(DBGMCU_CR1_DBG_TIM10_STOP)
#define LL_DBGMCU_TIM10_STOP                 DBGMCU_CR1_DBG_TIM10_STOP
#endif

#if defined(DBGMCU_CR1_DBG_TIM11_STOP)
#define LL_DBGMCU_TIM11_STOP                 DBGMCU_CR1_DBG_TIM11_STOP
#endif

#if defined(DBGMCU_CR1_DBG_TIM12_STOP)
#define LL_DBGMCU_TIM12_STOP                 DBGMCU_CR1_DBG_TIM12_STOP
#endif

#if defined(DBGMCU_CR1_DBG_TIM13_STOP)
#define LL_DBGMCU_TIM13_STOP                 DBGMCU_CR1_DBG_TIM13_STOP
#endif

#if defined(DBGMCU_CR1_DBG_TIM14_STOP)
#define LL_DBGMCU_TIM14_STOP                 DBGMCU_CR1_DBG_TIM14_STOP
#endif

#if defined(DBGMCU_CR2_DBG_I2C3_SMBUS_TIMEOUT)
#define LL_DBGMCU_I2C3_SMBUS_TIMEOUT         DBGMCU_CR2_DBG_I2C3_SMBUS_TIMEOUT
#endif

#if defined(DBGMCU_CR2_DBG_I2C4_SMBUS_TIMEOUT)
#define LL_DBGMCU_I2C4_SMBUS_TIMEOUT         DBGMCU_CR2_DBG_I2C4_SMBUS_TIMEOUT
#endif

#if defined(DBGMCU_CR2_DBG_CAN2_STOP)
#define LL_DBGMCU_CAN2_STOP                  DBGMCU_CR2_DBG_CAN2_STOP
#endif

#if defined(DBGMCU_CR2_DBG_TIM15_STOP)
#define LL_DBGMCU_TIM15_STOP                 DBGMCU_CR2_DBG_TIM15_STOP
#endif

#if defined(DBGMCU_CR2_DBG_TIM16_STOP)
#define LL_DBGMCU_TIM16_STOP                 DBGMCU_CR2_DBG_TIM16_STOP
#endif

#if defined(DBGMCU_CR2_DBG_TIM17_STOP)
#define LL_DBGMCU_TIM17_STOP                 DBGMCU_CR2_DBG_TIM17_STOP
#endif

#if defined(DBGMCU_CR2_DBG_TIM18_STOP)
#define LL_DBGMCU_TIM18_STOP                 DBGMCU_CR2_DBG_TIM18_STOP
#endif

#if defined(DBGMCU_CR2_DBG_TIM19_STOP)
#define LL_DBGMCU_TIM19_STOP                 DBGMCU_CR2_DBG_TIM19_STOP
#endif

#if defined(DBGMCU_CR2_DBG_LPTIM_STOP)
#define LL_DBGMCU_LPTIM_STOP                 DBGMCU_CR2_DBG_LPTIM_STOP
#endif

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Functions SYSTEM Exported Functions
  * @{
  */

/** @defgroup SYSTEM_LL_EF_SYSCFG SYSCFG
  * @{
  */

/**
  * @brief  Set memory mapping at address 0x00000000
  * @rmtoll SYSCFG_CFGR1 MEM_MODE      LL_SYSCFG_SetRemapMemory
  * @param  Memory This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_REMAP_FLASH
  *         @arg @ref LL_SYSCFG_REMAP_SYSTEMFLASH
  *         @arg @ref LL_SYSCFG_REMAP_ESMC
  *         @arg @ref LL_SYSCFG_REMAP_SRAM
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetRemapMemory(uint32_t Memory)
{
  MODIFY_REG(SYSCFG->CFGR[0], SYSCFG_CFGR1_MEM_MODE, Memory);
}

/**
  * @brief  Get memory mapping at address 0x00000000
  * @rmtoll SYSCFG_CFGR1 MEM_MODE      LL_SYSCFG_GetRemapMemory
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SYSCFG_REMAP_FLASH
  *         @arg @ref LL_SYSCFG_REMAP_SYSTEMFLASH
  *         @arg @ref LL_SYSCFG_REMAP_ESMC
  *         @arg @ref LL_SYSCFG_REMAP_SRAM
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetRemapMemory(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CFGR[0], SYSCFG_CFGR1_MEM_MODE));
}

/**
  * @brief  Set Ethernet physical interface.
  * @rmtoll SYSCFG_CFGR1 ETH_PHYSEL      LL_SYSCFG_SetETHPhysicalInterface
  * @param  Interface This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH_PHY_MII
  *         @arg @ref LL_SYSCFG_ETH_PHY_RMII
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetETHPhysicalInterface(uint32_t Interface)
{
  MODIFY_REG(SYSCFG->CFGR[0], SYSCFG_CFGR1_ETH_PHYSEL, Interface);
}

/**
  * @brief  Get Ethernet physical interface.
  * @rmtoll SYSCFG_CFGR1 ETH_PHYSEL      LL_SYSCFG_GetETHPhysicalInterface
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SYSCFG_ETH_PHY_MII
  *         @arg @ref LL_SYSCFG_ETH_PHY_RMII
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetETHPhysicalInterface(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CFGR[0], SYSCFG_CFGR1_ETH_PHYSEL));
}

/**
  * @brief  Set remap TIM2 internal trigger1
  * @rmtoll SYSCFG_CFGR1 TIM2ITR1_REMAP      LL_SYSCFG_SetRemapTIM2InternalTrigger1
  * @param  TIM2IneternalTrigger1 This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_TIM2_INTERNAL_TRIGGER1_NONE
  *         @arg @ref LL_SYSCFG_TIM2_INTERNAL_TRIGGER1_USB1_SOF
  *         @arg @ref LL_SYSCFG_TIM2_INTERNAL_TRIGGER1_USB2_SOF
  *         @arg @ref LL_SYSCFG_TIM2_INTERNAL_TRIGGER1_ETH_PTP_INTR
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetRemapTIM2InternalTrigger1(uint32_t TIM2IneternalTrigger1)
{
  MODIFY_REG(SYSCFG->CFGR[0], SYSCFG_CFGR1_TIM2ITR1_REMAP, TIM2IneternalTrigger1);
}

/**
  * @brief  Get remapping of TIM2 internal trigger1
  * @rmtoll SYSCFG_CFGR1 TIM2ITR1_REMAP      LL_SYSCFG_GetRemapTIM2InternalTrigger1
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SYSCFG_TIM2_INTERNAL_TRIGGER1_NONE
  *         @arg @ref LL_SYSCFG_TIM2_INTERNAL_TRIGGER1_USB1_SOF
  *         @arg @ref LL_SYSCFG_TIM2_INTERNAL_TRIGGER1_USB2_SOF
  *         @arg @ref LL_SYSCFG_TIM2_INTERNAL_TRIGGER1_ETH_PTP_INTR
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetRemapTIM2InternalTrigger1(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CFGR[0], SYSCFG_CFGR1_TIM2ITR1_REMAP));
}

/**
  * @brief  Enable the remapping of ETH_PTP_PPS.
  * @rmtoll SYSCFG_CFGR1 PTP_PPS_REMAP        LL_SYSCFG_EnableEthernetPtpPpsRemap
  * @note  ENABLE: PTP_PPS is output on PB5 pin.
  * @note  This bit is available only in connectivity line devices and is reserved otherwise.
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableEthernetPtpPpsRemap(void)
{
  SET_BIT(SYSCFG->CFGR[0], SYSCFG_CFGR1_PTP_PPS_REMAP);
}

/**
  * @brief  Disable the remapping of ETH_PTP_PPS.
  * @rmtoll SYSCFG_CFGR1 PTP_PPS_REMAP        LL_SYSCFG_DisableEthernetPtpPpsRemap
  * @note  DISABLE: PTP_PPS not output on PB5 pin.
  * @note  This bit is available only in connectivity line devices and is reserved otherwise.
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableEthernetPtpPpsRemap(void)
{
  CLEAR_BIT(SYSCFG->CFGR[0], SYSCFG_CFGR1_PTP_PPS_REMAP);
}

/**
  * @brief  Indicate if enable the remapping of ETH_PTP_PPS.
  * @rmtoll SYSCFG_CFGR1 PTP_PPS_REMAP        LL_SYSCFG_IsEnabledEthernetPtpPpsRemap
  * @note  PTP_PPS output on PB5 pin.
  * @note  This bit is available only in connectivity line devices and is reserved otherwise.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledEthernetPtpPpsRemap(void)
{
  return ((READ_BIT(SYSCFG->CFGR[0], SYSCFG_CFGR1_PTP_PPS_REMAP) == (SYSCFG_CFGR1_PTP_PPS_REMAP)) ? 1UL : 0UL);
}

/**
  * @brief  Set USB SOF for configuring CTC comes from.
  * @rmtoll SYSCFG_CFGR1 CTC_SOF_SEL      LL_SYSCFG_SetCtcUsbsof
  * @param  Usbsof This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_CTC_SOF_FROM_USB1
  *         @arg @ref LL_SYSCFG_CTC_SOF_FROM_USB2
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetCtcUsbsof(uint32_t Usbsof)
{
  MODIFY_REG(SYSCFG->CFGR[0], SYSCFG_CFGR1_CTC_SOF_SEL, Usbsof);
}

/**
  * @brief  Get USB SOF for configuring CTC comes from.
  * @rmtoll SYSCFG_CFGR1 CTC_SOF_SEL      LL_SYSCFG_GetCtcUsbsof
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SYSCFG_CTC_SOF_FROM_USB1
  *         @arg @ref LL_SYSCFG_CTC_SOF_FROM_USB2
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetCtcUsbsof(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CFGR[0], SYSCFG_CFGR1_CTC_SOF_SEL));
}

/**
  * @brief  Enable the I2C fast mode plus driving capability.
  * @rmtoll SYSCFG_CFGR1 I2C_FMP_I2C1  LL_SYSCFG_EnableFastModePlus\n
  *         SYSCFG_CFGR1 I2C_FMP_I2C2  LL_SYSCFG_EnableFastModePlus\n
  *         SYSCFG_CFGR1 I2C_FMP_I2C3  LL_SYSCFG_EnableFastModePlus\n
  *         SYSCFG_CFGR1 I2C_FMP_I2C4  LL_SYSCFG_EnableFastModePlus
  * @param  ConfigFastModePlus This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C1
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C2
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C3
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C4
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableFastModePlus(uint32_t ConfigFastModePlus)
{
  SET_BIT(SYSCFG->CFGR[0], ConfigFastModePlus);
}

/**
  * @brief  Disable the I2C fast mode plus driving capability.
  * @rmtoll SYSCFG_CFGR1 I2C_FMP_I2C1  LL_SYSCFG_DisableFastModePlus\n
  *         SYSCFG_CFGR1 I2C_FMP_I2C2  LL_SYSCFG_DisableFastModePlus\n
  *         SYSCFG_CFGR1 I2C_FMP_I2C3  LL_SYSCFG_DisableFastModePlus\n
  *         SYSCFG_CFGR1 I2C_FMP_I2C4  LL_SYSCFG_DisableFastModePlus
  * @param  ConfigFastModePlus This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C1
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C2
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C3
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C4
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableFastModePlus(uint32_t ConfigFastModePlus)
{
  CLEAR_BIT(SYSCFG->CFGR[0], ConfigFastModePlus);
}

/**
  * @brief  Indicate if enable the I2C fast mode plus driving capability.
  * @rmtoll SYSCFG_CFGR1 I2C_FMP_I2C1  LL_SYSCFG_IsEnabledFastModePlus\n
  *         SYSCFG_CFGR1 I2C_FMP_I2C2  LL_SYSCFG_IsEnabledFastModePlus\n
  *         SYSCFG_CFGR1 I2C_FMP_I2C3  LL_SYSCFG_IsEnabledFastModePlus\n
  *         SYSCFG_CFGR1 I2C_FMP_I2C4  LL_SYSCFG_IsEnabledFastModePlus
  * @param  ConfigFastModePlus This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C1
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C2
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C3
  *         @arg @ref LL_SYSCFG_I2C_FASTMODEPLUS_I2C4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledFastModePlus(uint32_t ConfigFastModePlus)
{
  return ((READ_BIT(SYSCFG->CFGR[0], ConfigFastModePlus) == (ConfigFastModePlus)) ? 1UL : 0UL);
}

/**
  * @brief  Enable analog filter of I2C related IO
  * @rmtoll SYSCFG_CFGR1 I2C_EIIC  LL_SYSCFG_EnableI2CAnalogFilter\n
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  I2CAnalogFilter This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA8
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA9
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA13
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA14
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA15
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB5
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB7
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB8
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB9
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC3
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC6
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC7
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC8
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC9
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC11
  *         @arg @ref LL_SYSCFG_I2C_ANF_PF0
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableI2CAnalogFilter(uint32_t I2CAnalogFilter)
{
  SET_BIT(SYSCFG->CFGR[0],I2CAnalogFilter);
}

/**
  * @brief  Disable analog filter of I2C related IO
  * @rmtoll SYSCFG_CFGR1 I2C_EIIC  LL_SYSCFG_DisableI2CAnalogFilter\n
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  I2CAnalogFilter This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA8
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA9
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA13
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA14
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA15
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB5
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB7
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB8
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB9
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC3
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC6
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC7
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC8
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC9
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC11
  *         @arg @ref LL_SYSCFG_I2C_ANF_PF0
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableI2CAnalogFilter(uint32_t I2CAnalogFilter)
{
  CLEAR_BIT(SYSCFG->CFGR[0],I2CAnalogFilter);
}

/**
  * @brief  Indicate if enable the analog filter of I2C related IO.
  * @rmtoll SYSCFG_CFGR1 I2C_EIIC  LL_SYSCFG_IsEnabledI2CAnalogFilter\n
  * @param  I2CAnalogFilter This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA8
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA9
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA13
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA14
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA15
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB5
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB7
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB8
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB9
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC3
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC6
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC7
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC8
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC9
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC11
  *         @arg @ref LL_SYSCFG_I2C_ANF_PF0
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledI2CAnalogFilter(uint32_t I2CAnalogFilter)
{
  return ((READ_BIT(SYSCFG->CFGR[0], I2CAnalogFilter) == (I2CAnalogFilter)) ? 1UL : 0UL);
}

/**
  * @brief  Set connections to TIM1/8/15/16/17 Break inputs
  * @rmtoll SYSCFG_CFGR2 CLL           LL_SYSCFG_SetTIMBreakInputs\n
  *         SYSCFG_CFGR2 SPL           LL_SYSCFG_SetTIMBreakInputs\n
  *         SYSCFG_CFGR2 PVDL          LL_SYSCFG_SetTIMBreakInputs\n
  *         SYSCFG_CFGR2 ECCL          LL_SYSCFG_SetTIMBreakInputs
  * @param  Break This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_TIMBREAK_LOCKUP
  *         @arg @ref LL_SYSCFG_TIMBREAK_SRAM_PARITY
  *         @arg @ref LL_SYSCFG_TIMBREAK_PVD
  *         @arg @ref LL_SYSCFG_TIMBREAK_ECC
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetTIMBreakInputs(uint32_t Break)
{
  MODIFY_REG(SYSCFG->CFGR[1], SYSCFG_CFGR2_CLL | SYSCFG_CFGR2_SPL | SYSCFG_CFGR2_PVDL | SYSCFG_CFGR2_ECCL, Break);
}

/**
  * @brief  Get connections to TIM1/8/15/16/17 Break inputs
  * @rmtoll SYSCFG_CFGR2 CLL           LL_SYSCFG_GetTIMBreakInputs\n
  *         SYSCFG_CFGR2 SPL           LL_SYSCFG_GetTIMBreakInputs\n
  *         SYSCFG_CFGR2 PVDL          LL_SYSCFG_GetTIMBreakInputs\n
  *         SYSCFG_CFGR2 ECCL          LL_SYSCFG_GetTIMBreakInputs
  * @retval Returned value can be can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_TIMBREAK_ECC
  *         @arg @ref LL_SYSCFG_TIMBREAK_PVD
  *         @arg @ref LL_SYSCFG_TIMBREAK_SRAM_PARITY
  *         @arg @ref LL_SYSCFG_TIMBREAK_LOCKUP
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetTIMBreakInputs(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CFGR[1], SYSCFG_CFGR2_CLL | SYSCFG_CFGR2_SPL | SYSCFG_CFGR2_PVDL | SYSCFG_CFGR2_ECCL));
}

/**
  * @brief  Configure source input for the EXTI external interrupt.
  * @rmtoll SYSCFG_EXTICR1 EXTIx         LL_SYSCFG_SetEXTISource\n
  *         SYSCFG_EXTICR2 EXTIx         LL_SYSCFG_SetEXTISource\n
  *         SYSCFG_EXTICR3 EXTIx         LL_SYSCFG_SetEXTISource\n
  *         SYSCFG_EXTICR4 EXTIx         LL_SYSCFG_SetEXTISource
  * @param  Port This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_EXTI_PORTA
  *         @arg @ref LL_SYSCFG_EXTI_PORTB
  *         @arg @ref LL_SYSCFG_EXTI_PORTC
  *         @arg @ref LL_SYSCFG_EXTI_PORTD
  *         @arg @ref LL_SYSCFG_EXTI_PORTE
  *         @arg @ref LL_SYSCFG_EXTI_PORTF
  * @param  Line This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_EXTI_LINE0 
  *         @arg @ref LL_SYSCFG_EXTI_LINE1 
  *         @arg @ref LL_SYSCFG_EXTI_LINE2 
  *         @arg @ref LL_SYSCFG_EXTI_LINE3 
  *         @arg @ref LL_SYSCFG_EXTI_LINE4 
  *         @arg @ref LL_SYSCFG_EXTI_LINE5 
  *         @arg @ref LL_SYSCFG_EXTI_LINE6 
  *         @arg @ref LL_SYSCFG_EXTI_LINE7 
  *         @arg @ref LL_SYSCFG_EXTI_LINE8 
  *         @arg @ref LL_SYSCFG_EXTI_LINE9 
  *         @arg @ref LL_SYSCFG_EXTI_LINE10
  *         @arg @ref LL_SYSCFG_EXTI_LINE11
  *         @arg @ref LL_SYSCFG_EXTI_LINE12
  *         @arg @ref LL_SYSCFG_EXTI_LINE13
  *         @arg @ref LL_SYSCFG_EXTI_LINE14
  *         @arg @ref LL_SYSCFG_EXTI_LINE15
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetEXTISource(uint32_t Port, uint32_t Line)
{
  MODIFY_REG(SYSCFG->EXTICR[Line & 0xFF], (Line >> 16), Port << POSITION_VAL((Line >> 16)));
}

/**
  * @brief  Get the configured defined for specific EXTI Line
  * @rmtoll SYSCFG_EXTICR1 EXTIx         LL_SYSCFG_GetEXTISource\n
  *         SYSCFG_EXTICR2 EXTIx         LL_SYSCFG_GetEXTISource\n
  *         SYSCFG_EXTICR3 EXTIx         LL_SYSCFG_GetEXTISource\n
  *         SYSCFG_EXTICR4 EXTIx         LL_SYSCFG_GetEXTISource
  * @param  Line This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_EXTI_LINE0 
  *         @arg @ref LL_SYSCFG_EXTI_LINE1 
  *         @arg @ref LL_SYSCFG_EXTI_LINE2 
  *         @arg @ref LL_SYSCFG_EXTI_LINE3 
  *         @arg @ref LL_SYSCFG_EXTI_LINE4 
  *         @arg @ref LL_SYSCFG_EXTI_LINE5 
  *         @arg @ref LL_SYSCFG_EXTI_LINE6 
  *         @arg @ref LL_SYSCFG_EXTI_LINE7 
  *         @arg @ref LL_SYSCFG_EXTI_LINE8 
  *         @arg @ref LL_SYSCFG_EXTI_LINE9 
  *         @arg @ref LL_SYSCFG_EXTI_LINE10
  *         @arg @ref LL_SYSCFG_EXTI_LINE11
  *         @arg @ref LL_SYSCFG_EXTI_LINE12
  *         @arg @ref LL_SYSCFG_EXTI_LINE13
  *         @arg @ref LL_SYSCFG_EXTI_LINE14
  *         @arg @ref LL_SYSCFG_EXTI_LINE15
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SYSCFG_EXTI_PORTA
  *         @arg @ref LL_SYSCFG_EXTI_PORTB
  *         @arg @ref LL_SYSCFG_EXTI_PORTC
  *         @arg @ref LL_SYSCFG_EXTI_PORTD
  *         @arg @ref LL_SYSCFG_EXTI_PORTE
  *         @arg @ref LL_SYSCFG_EXTI_PORTF
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetEXTISource(uint32_t Line)
{
  return (uint32_t)(READ_BIT(SYSCFG->EXTICR[Line & 0xFF], (Line >> 16)) >> POSITION_VAL(Line >> 16));
}

/**
  * @brief  Enable GPIO Filter
  * @rmtoll SYSCFG_PAENS PA_ENS         LL_SYSCFG_EnableGPIOFilter\n
  *         SYSCFG_PBENS PB_ENS         LL_SYSCFG_EnableGPIOFilter\n
  *         SYSCFG_PCENS PC_ENS         LL_SYSCFG_EnableGPIOFilter\n
  *         SYSCFG_PDENS PD_ENS         LL_SYSCFG_EnableGPIOFilter\n
  *         SYSCFG_PEENS PE_ENS         LL_SYSCFG_EnableGPIOFilter\n
  *         SYSCFG_PFENS PF_ENS         LL_SYSCFG_EnableGPIOFilter
  * @param  GPIOPort This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIO_PORTA
  *         @arg @ref LL_SYSCFG_GPIO_PORTB
  *         @arg @ref LL_SYSCFG_GPIO_PORTC
  *         @arg @ref LL_SYSCFG_GPIO_PORTD
  *         @arg @ref LL_SYSCFG_GPIO_PORTE
  *         @arg @ref LL_SYSCFG_GPIO_PORTF
  * @param  GPIOPin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIO_PIN_0
  *         @arg @ref LL_SYSCFG_GPIO_PIN_1
  *         @arg @ref LL_SYSCFG_GPIO_PIN_2
  *         @arg @ref LL_SYSCFG_GPIO_PIN_3
  *         @arg @ref LL_SYSCFG_GPIO_PIN_4
  *         @arg @ref LL_SYSCFG_GPIO_PIN_5
  *         @arg @ref LL_SYSCFG_GPIO_PIN_6
  *         @arg @ref LL_SYSCFG_GPIO_PIN_7
  *         @arg @ref LL_SYSCFG_GPIO_PIN_8
  *         @arg @ref LL_SYSCFG_GPIO_PIN_9
  *         @arg @ref LL_SYSCFG_GPIO_PIN_10
  *         @arg @ref LL_SYSCFG_GPIO_PIN_11
  *         @arg @ref LL_SYSCFG_GPIO_PIN_12
  *         @arg @ref LL_SYSCFG_GPIO_PIN_13
  *         @arg @ref LL_SYSCFG_GPIO_PIN_14
  *         @arg @ref LL_SYSCFG_GPIO_PIN_15
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableGPIOFilter(uint32_t GPIOPort, uint32_t GPIOPin)
{
  if(GPIOPort == LL_SYSCFG_GPIO_PORTA)
  {
    SET_BIT(SYSCFG->PAENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTB)
  {
    SET_BIT(SYSCFG->PBENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTC)
  {
    SET_BIT(SYSCFG->PCENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTD)
  {
    SET_BIT(SYSCFG->PDENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTE)
  {
    SET_BIT(SYSCFG->PEENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTF)
  {
    SET_BIT(SYSCFG->PFENS, GPIOPin);
  }
  else
  {
    
