Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_system.h
  }
}

/**
  * @brief  Disable GPIO Filter
  * @rmtoll SYSCFG_PAENS PA_ENS         LL_SYSCFG_EnableGPIOFilter\n
  *         SYSCFG_PBENS PB_ENS         LL_SYSCFG_EnableGPIOFilter\n
  *         SYSCFG_PCENS PC_ENS         LL_SYSCFG_EnableGPIOFilter\n
  *         SYSCFG_PDENS PD_ENS         LL_SYSCFG_EnableGPIOFilter\n
  *         SYSCFG_PEENS PE_ENS         LL_SYSCFG_EnableGPIOFilter\n
  *         SYSCFG_PFENS PF_ENS         LL_SYSCFG_EnableGPIOFilter
  * @param  GPIOPort This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIO_PORTA
  *         @arg @ref LL_SYSCFG_GPIO_PORTB
  *         @arg @ref LL_SYSCFG_GPIO_PORTC
  *         @arg @ref LL_SYSCFG_GPIO_PORTD
  *         @arg @ref LL_SYSCFG_GPIO_PORTE
  *         @arg @ref LL_SYSCFG_GPIO_PORTF
  * @param  GPIOPin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIO_PIN_0
  *         @arg @ref LL_SYSCFG_GPIO_PIN_1
  *         @arg @ref LL_SYSCFG_GPIO_PIN_2
  *         @arg @ref LL_SYSCFG_GPIO_PIN_3
  *         @arg @ref LL_SYSCFG_GPIO_PIN_4
  *         @arg @ref LL_SYSCFG_GPIO_PIN_5
  *         @arg @ref LL_SYSCFG_GPIO_PIN_6
  *         @arg @ref LL_SYSCFG_GPIO_PIN_7
  *         @arg @ref LL_SYSCFG_GPIO_PIN_8
  *         @arg @ref LL_SYSCFG_GPIO_PIN_9
  *         @arg @ref LL_SYSCFG_GPIO_PIN_10
  *         @arg @ref LL_SYSCFG_GPIO_PIN_11
  *         @arg @ref LL_SYSCFG_GPIO_PIN_12
  *         @arg @ref LL_SYSCFG_GPIO_PIN_13
  *         @arg @ref LL_SYSCFG_GPIO_PIN_14
  *         @arg @ref LL_SYSCFG_GPIO_PIN_15
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableGPIOFilter(uint32_t GPIOPort, uint32_t GPIOPin)
{
  if(GPIOPort == LL_SYSCFG_GPIO_PORTA)
  {
    CLEAR_BIT(SYSCFG->PAENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTB)
  {
    CLEAR_BIT(SYSCFG->PBENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTC)
  {
    CLEAR_BIT(SYSCFG->PCENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTD)
  {
    CLEAR_BIT(SYSCFG->PDENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTE)
  {
    CLEAR_BIT(SYSCFG->PEENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTF)
  {
    CLEAR_BIT(SYSCFG->PFENS, GPIOPin);
  }
  else
  {
    
  }
}

/**
  * @brief  Enable GPIOA Analog2
  * @rmtoll SYSCFG_PA_ANA2ENR PA0_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA1_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA2_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA3_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA4_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA5_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA7_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA10_ENA2        LL_SYSCFG_EnableGPIOAAnalog2
  * @param  GPIOx_Pin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_0
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_1
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_2
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_3
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_4
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_5
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_7
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_10
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableGPIOAAnalog2(uint32_t GPIOx_Pin)
{
  SET_BIT(SYSCFG->PAANA2ENR,GPIOx_Pin);
}

/**
  * @brief  Disable GPIOA Analog2
  * @rmtoll SYSCFG_PA_ANA2ENR PA0_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA1_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA2_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA3_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA4_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA5_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA7_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA10_ENA2        LL_SYSCFG_EnableGPIOAAnalog2
  * @param  GPIOx_Pin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_0
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_1
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_2
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_3
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_4
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_5
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_7
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_10
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableGPIOAAnalog2(uint32_t GPIOx_Pin)
{
  CLEAR_BIT(SYSCFG->PAANA2ENR,GPIOx_Pin);
}

/**
  * @brief  Indicate if enable the GPIO State in GPIOA Analog2
  * @rmtoll SYSCFG_PA_ANA2ENR PA0_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA1_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA2_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA3_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA4_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA5_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA7_ENA2         LL_SYSCFG_EnableGPIOAAnalog2\n
  * @rmtoll SYSCFG_PA_ANA2ENR PA10_ENA2        LL_SYSCFG_EnableGPIOAAnalog2
  * @param  GPIOx_Pin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_0
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_1
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_2
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_3
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_4
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_5
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_7
  *         @arg @ref LL_SYSCFG_GPIOA_PIN_10
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledGPIOAAnalog2(uint32_t GPIOx_Pin)
{
  return ((READ_BIT(SYSCFG->PAANA2ENR, GPIOx_Pin) == (GPIOx_Pin)) ? 1UL : 0UL);
}

/**
  * @brief  Enable GPIOB Analog2
  * @rmtoll SYSCFG_PB_ANA2ENR PB0_ENA2         LL_SYSCFG_EnableGPIOBAnalog2\n
  * @rmtoll SYSCFG_PB_ANA2ENR PB1_ENA2         LL_SYSCFG_EnableGPIOBAnalog2\n
  * @rmtoll SYSCFG_PB_ANA2ENR PB2_ENA2         LL_SYSCFG_EnableGPIOBAnalog2
  * @param  GPIOx_Pin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIOB_PIN_0
  *         @arg @ref LL_SYSCFG_GPIOB_PIN_1
  *         @arg @ref LL_SYSCFG_GPIOB_PIN_2
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableGPIOBAnalog2(uint32_t GPIOx_Pin)
{
  SET_BIT(SYSCFG->PBANA2ENR,GPIOx_Pin);
}

/**
  * @brief  Disable GPIOB Analog2
  * @rmtoll SYSCFG_PB_ANA2ENR PB0_ENA2         LL_SYSCFG_EnableGPIOBAnalog2\n
  * @rmtoll SYSCFG_PB_ANA2ENR PB1_ENA2         LL_SYSCFG_EnableGPIOBAnalog2\n
  * @rmtoll SYSCFG_PB_ANA2ENR PB2_ENA2         LL_SYSCFG_EnableGPIOBAnalog2
  * @param  GPIOx_Pin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIOB_PIN_0
  *         @arg @ref LL_SYSCFG_GPIOB_PIN_1
  *         @arg @ref LL_SYSCFG_GPIOB_PIN_2
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableGPIOBAnalog2(uint32_t GPIOx_Pin)
{
  CLEAR_BIT(SYSCFG->PBANA2ENR,GPIOx_Pin);
}

/**
  * @brief  Indicate if enable the GPIO State in GPIOB Analog2
  * @rmtoll SYSCFG_PB_ANA2ENR PB0_ENA2         LL_SYSCFG_EnableGPIOBAnalog2\n
  * @rmtoll SYSCFG_PB_ANA2ENR PB1_ENA2         LL_SYSCFG_EnableGPIOBAnalog2\n
  * @rmtoll SYSCFG_PB_ANA2ENR PB2_ENA2         LL_SYSCFG_EnableGPIOBAnalog2
  * @param  GPIOx_Pin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIOB_PIN_0
  *         @arg @ref LL_SYSCFG_GPIOB_PIN_1
  *         @arg @ref LL_SYSCFG_GPIOB_PIN_2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledGPIOBAnalog2(uint32_t GPIOx_Pin)
{
  return ((READ_BIT(SYSCFG->PBANA2ENR, GPIOx_Pin) == (GPIOx_Pin)) ? 1UL : 0UL);
}

/**
  * @brief  Enable GPIOC Analog2
  * @rmtoll SYSCFG_PC_ANA2ENR PC0_ENA2         LL_SYSCFG_EnableGPIOCAnalog2\n
  * @rmtoll SYSCFG_PC_ANA2ENR PC1_ENA2         LL_SYSCFG_EnableGPIOCAnalog2\n
  * @rmtoll SYSCFG_PC_ANA2ENR PC2_ENA2         LL_SYSCFG_EnableGPIOCAnalog2\n
  * @rmtoll SYSCFG_PC_ANA2ENR PC3_ENA2         LL_SYSCFG_EnableGPIOCAnalog2\n
  * @rmtoll SYSCFG_PC_ANA2ENR PC14_ENA2        LL_SYSCFG_EnableGPIOCAnalog2\n
  * @rmtoll SYSCFG_PC_ANA2ENR PC15_ENA2        LL_SYSCFG_EnableGPIOCAnalog2
  * @param  GPIOx_Pin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_0 
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_1 
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_2 
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_3 
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_14
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_15
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableGPIOCAnalog2(uint32_t GPIOx_Pin)
{
  SET_BIT(SYSCFG->PCANA2ENR,GPIOx_Pin);
}

/**
  * @brief  Disable GPIOC Analog2
  * @rmtoll SYSCFG_PC_ANA2ENR PC0_ENA2         LL_SYSCFG_EnableGPIOCAnalog2\n
  * @rmtoll SYSCFG_PC_ANA2ENR PC1_ENA2         LL_SYSCFG_EnableGPIOCAnalog2\n
  * @rmtoll SYSCFG_PC_ANA2ENR PC2_ENA2         LL_SYSCFG_EnableGPIOCAnalog2\n
  * @rmtoll SYSCFG_PC_ANA2ENR PC3_ENA2         LL_SYSCFG_EnableGPIOCAnalog2\n
  * @rmtoll SYSCFG_PC_ANA2ENR PC14_ENA2        LL_SYSCFG_EnableGPIOCAnalog2\n
  * @rmtoll SYSCFG_PC_ANA2ENR PC15_ENA2        LL_SYSCFG_EnableGPIOCAnalog2
  * @param  GPIOx_Pin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_0 
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_1 
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_2 
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_3 
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_14
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_15
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableGPIOCAnalog2(uint32_t GPIOx_Pin)
{
  CLEAR_BIT(SYSCFG->PCANA2ENR,GPIOx_Pin);
}

/**
  * @brief  Indicate if enable the GPIO State in GPIOC Analog2
  * @rmtoll SYSCFG_PC_ANA2ENR PC0_ENA2         LL_SYSCFG_EnableGPIOCAnalog2\n
  * @rmtoll SYSCFG_PC_ANA2ENR PC1_ENA2         LL_SYSCFG_EnableGPIOCAnalog2\n
  * @rmtoll SYSCFG_PC_ANA2ENR PC2_ENA2         LL_SYSCFG_EnableGPIOCAnalog2\n
  * @rmtoll SYSCFG_PC_ANA2ENR PC3_ENA2         LL_SYSCFG_EnableGPIOCAnalog2\n
  * @rmtoll SYSCFG_PC_ANA2ENR PC14_ENA2        LL_SYSCFG_EnableGPIOCAnalog2\n
  * @rmtoll SYSCFG_PC_ANA2ENR PC15_ENA2        LL_SYSCFG_EnableGPIOCAnalog2
  * @param  GPIOx_Pin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_0 
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_1 
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_2 
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_3 
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_14
  *         @arg @ref LL_SYSCFG_GPIOC_PIN_15
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledGPIOCAnalog2(uint32_t GPIOx_Pin)
{
  return ((READ_BIT(SYSCFG->PCANA2ENR, GPIOx_Pin) == (GPIOx_Pin)) ? 1UL : 0UL);
}

/**
  * @brief  Enable GPIOD Analog2
  * @rmtoll SYSCFG_PD_ANA2ENR PD10_ENA2         LL_SYSCFG_EnableGPIODAnalog2\n
  * @rmtoll SYSCFG_PD_ANA2ENR PD11_ENA2         LL_SYSCFG_EnableGPIODAnalog2\n
  * @rmtoll SYSCFG_PD_ANA2ENR PD12_ENA2         LL_SYSCFG_EnableGPIODAnalog2\n
  * @rmtoll SYSCFG_PD_ANA2ENR PD13_ENA2         LL_SYSCFG_EnableGPIODAnalog2
  * @param  GPIOx_Pin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIOD_PIN_10 
  *         @arg @ref LL_SYSCFG_GPIOD_PIN_11 
  *         @arg @ref LL_SYSCFG_GPIOD_PIN_12 
  *         @arg @ref LL_SYSCFG_GPIOD_PIN_13 
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableGPIODAnalog2(uint32_t GPIOx_Pin)
{
  SET_BIT(SYSCFG->PDANA2ENR,GPIOx_Pin);
}

/**
  * @brief  Disable GPIOD Analog2
  * @rmtoll SYSCFG_PD_ANA2ENR PD10_ENA2         LL_SYSCFG_EnableGPIODAnalog2\n
  * @rmtoll SYSCFG_PD_ANA2ENR PD11_ENA2         LL_SYSCFG_EnableGPIODAnalog2\n
  * @rmtoll SYSCFG_PD_ANA2ENR PD12_ENA2         LL_SYSCFG_EnableGPIODAnalog2\n
  * @rmtoll SYSCFG_PD_ANA2ENR PD13_ENA2         LL_SYSCFG_EnableGPIODAnalog2
  * @param  GPIOx_Pin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIOD_PIN_10 
  *         @arg @ref LL_SYSCFG_GPIOD_PIN_11 
  *         @arg @ref LL_SYSCFG_GPIOD_PIN_12 
  *         @arg @ref LL_SYSCFG_GPIOD_PIN_13 
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableGPIODAnalog2(uint32_t GPIOx_Pin)
{
  CLEAR_BIT(SYSCFG->PDANA2ENR,GPIOx_Pin);
}

/**
  * @brief  Indicate if enable the GPIO State in GPIOD Analog2
  * @rmtoll SYSCFG_PD_ANA2ENR PD10_ENA2         LL_SYSCFG_EnableGPIODAnalog2\n
  * @rmtoll SYSCFG_PD_ANA2ENR PD11_ENA2         LL_SYSCFG_EnableGPIODAnalog2\n
  * @rmtoll SYSCFG_PD_ANA2ENR PD12_ENA2         LL_SYSCFG_EnableGPIODAnalog2\n
  * @rmtoll SYSCFG_PD_ANA2ENR PD13_ENA2         LL_SYSCFG_EnableGPIODAnalog2
  * @param  GPIOx_Pin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIOD_PIN_10 
  *         @arg @ref LL_SYSCFG_GPIOD_PIN_11 
  *         @arg @ref LL_SYSCFG_GPIOD_PIN_12 
  *         @arg @ref LL_SYSCFG_GPIOD_PIN_13 
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledGPIODAnalog2(uint32_t GPIOx_Pin)
{
  return ((READ_BIT(SYSCFG->PDANA2ENR, GPIOx_Pin) == (GPIOx_Pin)) ? 1UL : 0UL);
}

/**
  * @brief  Enable GPIOE Analog2
  * @rmtoll SYSCFG_PE_ANA2ENR PE7_ENA2          LL_SYSCFG_EnableGPIOEAnalog2\n
  * @rmtoll SYSCFG_PE_ANA2ENR PE10_ENA2         LL_SYSCFG_EnableGPIOEAnalog2\n
  * @rmtoll SYSCFG_PE_ANA2ENR PE11_ENA2         LL_SYSCFG_EnableGPIOEAnalog2\n
  * @rmtoll SYSCFG_PE_ANA2ENR PE12_ENA2         LL_SYSCFG_EnableGPIOEAnalog2
  * @param  GPIOx_Pin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIOE_PIN_7  
  *         @arg @ref LL_SYSCFG_GPIOE_PIN_10 
  *         @arg @ref LL_SYSCFG_GPIOE_PIN_11 
  *         @arg @ref LL_SYSCFG_GPIOE_PIN_12 
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableGPIOEAnalog2(uint32_t GPIOx_Pin)
{
  SET_BIT(SYSCFG->PEANA2ENR,GPIOx_Pin);
}

/**
  * @brief  Disable GPIOE Analog2
  * @rmtoll SYSCFG_PE_ANA2ENR PE7_ENA2          LL_SYSCFG_EnableGPIOEAnalog2\n
  * @rmtoll SYSCFG_PE_ANA2ENR PE10_ENA2         LL_SYSCFG_EnableGPIOEAnalog2\n
  * @rmtoll SYSCFG_PE_ANA2ENR PE11_ENA2         LL_SYSCFG_EnableGPIOEAnalog2\n
  * @rmtoll SYSCFG_PE_ANA2ENR PE12_ENA2         LL_SYSCFG_EnableGPIOEAnalog2
  * @param  GPIOx_Pin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIOE_PIN_7  
  *         @arg @ref LL_SYSCFG_GPIOE_PIN_10 
  *         @arg @ref LL_SYSCFG_GPIOE_PIN_11 
  *         @arg @ref LL_SYSCFG_GPIOE_PIN_12 
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableGPIOEAnalog2(uint32_t GPIOx_Pin)
{
  CLEAR_BIT(SYSCFG->PEANA2ENR,GPIOx_Pin);
}

/**
  * @brief  Indicate if enable the GPIO State in GPIOE Analog2
  * @rmtoll SYSCFG_PE_ANA2ENR PE7_ENA2          LL_SYSCFG_EnableGPIOEAnalog2\n
  * @rmtoll SYSCFG_PE_ANA2ENR PE10_ENA2         LL_SYSCFG_EnableGPIOEAnalog2\n
  * @rmtoll SYSCFG_PE_ANA2ENR PE11_ENA2         LL_SYSCFG_EnableGPIOEAnalog2\n
  * @rmtoll SYSCFG_PE_ANA2ENR PE12_ENA2         LL_SYSCFG_EnableGPIOEAnalog2
  * @param  GPIOx_Pin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIOE_PIN_7  
  *         @arg @ref LL_SYSCFG_GPIOE_PIN_10 
  *         @arg @ref LL_SYSCFG_GPIOE_PIN_11 
  *         @arg @ref LL_SYSCFG_GPIOE_PIN_12 
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledGPIOEAnalog2(uint32_t GPIOx_Pin)
{
  return ((READ_BIT(SYSCFG->PEANA2ENR, GPIOx_Pin) == (GPIOx_Pin)) ? 1UL : 0UL);
}

/**
  * @brief  Enable PVD_IN Analog2
  * @rmtoll SYSCFG_PVDIN_ANA2ENR PVDIN_ENA2          LL_SYSCFG_EnablePVDINAnalog2\n
  * @param  None
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnablePVDINAnalog2(void)
{
  SET_BIT(SYSCFG->PVDINANA2ENR,SYSCFG_PVDINANA2ENR_PVDIN_ENA2);
}

/**
  * @brief  Disable PVD_IN Analog2
  * @rmtoll SYSCFG_PVDIN_ANA2ENR PVDIN_ENA2          LL_SYSCFG_EnablePVDINAnalog2\n
  * @param  None
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisablePVDINAnalog2(void)
{
  CLEAR_BIT(SYSCFG->PVDINANA2ENR,SYSCFG_PVDINANA2ENR_PVDIN_ENA2);
}

/**
  * @brief  Indicate if enable the PVDIN State in PVDIN Analog2
  * @rmtoll SYSCFG_PVDIN_ANA2ENR PVDIN_ENA2          LL_SYSCFG_EnablePVDINAnalog2\n
  * @param  None
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledPVDINAnalog2(void)
{
  return ((READ_BIT(SYSCFG->PVDINANA2ENR, SYSCFG_PVDINANA2ENR_PVDIN_ENA2) == (SYSCFG_PVDINANA2ENR_PVDIN_ENA2)) ? 1UL : 0UL);
}

/**
  * @brief  Enable CCMSRAM page write protection
  * @rmtoll SYSCFG_SWPR  PAGEx         LL_SYSCFG_EnableCCMSRAMPageWRP
  * @param  CCMSRAMWRP This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE0 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE1 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE2 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE3 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE4 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE5 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE6 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE7 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE8 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE9 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE10
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE11
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE12
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE13
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE14
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE15
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE16
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE17
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE18
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE19
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE20
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE21
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE22
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE23
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE24
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE25
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE26
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE27
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE28
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE29
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE30
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE31
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableCCMSRAMPageWRP(uint32_t CCMSRAMWRP)
{
  SET_BIT(SYSCFG->SWPR, CCMSRAMWRP);
}

/**
  * @brief  Indicate if enable the CCMSRAM page write protection
  * @rmtoll SYSCFG_SWPR  PAGEx         LL_SYSCFG_IsEnabledCCMSRAMPageWRP
  * @param  CCMSRAMWRP This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE0 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE1 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE2 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE3 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE4 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE5 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE6 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE7 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE8 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE9 
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE10
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE11
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE12
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE13
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE14
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE15
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE16
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE17
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE18
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE19
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE20
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE21
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE22
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE23
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE24
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE25
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE26
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE27
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE28
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE29
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE30
  *         @arg @ref LL_SYSCFG_CCMSRAMWRP_PAGE31
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledCCMSRAMPageWRP(uint32_t CCMSRAMWRP)
{
  return ((READ_BIT(SYSCFG->SWPR, CCMSRAMWRP) == (CCMSRAMWRP)) ? 1UL : 0UL);
}

/**
  * @brief  CCMSRAM page write protection lock prior to erase
  * @rmtoll SYSCFG_SKR   KEY           LL_SYSCFG_LockCCMSRAMWRP
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_LockCCMSRAMWRP(void)
{
  /* Writing a wrong key reactivates the write protection */
  WRITE_REG(SYSCFG->SKR, 0x00);
}

/**
  * @brief  CCMSRAM page write protection unlock prior to erase
  * @rmtoll SYSCFG_SKR   KEY           LL_SYSCFG_UnlockCCMSRAMWRP
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_UnlockCCMSRAMWRP(void)
{
  /* unlock the write protection of the CCMER bit */
  WRITE_REG(SYSCFG->SKR, 0xCA);
  WRITE_REG(SYSCFG->SKR, 0x53);
}

/**
  * @brief  Enable CCMSRAM Erase (starts a hardware CCMSRAM erase operation. This bit is
  * automatically cleared at the end of the CCMSRAM erase operation.)
  * @note This bit is write-protected: setting this bit is possible only after the
  *       correct key sequence is written in the SYSCFG_SKR register as described in
  *       the Reference Manual.
  * @rmtoll SYSCFG_SCSR  CCMER       LL_SYSCFG_EnableCCMSRAMErase
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableCCMSRAMErase(void)
{
  /* Starts a hardware CCMSRAM erase operation*/
  SET_BIT(SYSCFG->SCSR, SYSCFG_SCSR_CCMER);
}

/**
  * @brief  Check if CCMSRAM erase operation is on going
  * @rmtoll SYSCFG_SCSR  CCMBSY      LL_SYSCFG_IsCCMSRAMEraseOngoing
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsCCMSRAMEraseOngoing(void)
{
  return ((READ_BIT(SYSCFG->SCSR, SYSCFG_SCSR_CCMBSY) == (SYSCFG_SCSR_CCMBSY)) ? 1UL : 0UL);
}

/**
  * @brief  Check if SRAM parity error detected
  * @rmtoll SYSCFG_CFGR2 SPF           LL_SYSCFG_IsActiveFlag_SP
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsActiveFlag_SP(void)
{
  return ((READ_BIT(SYSCFG->CFGR[1], SYSCFG_CFGR2_SPF) == (SYSCFG_CFGR2_SPF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear SRAM parity error flag
  * @rmtoll SYSCFG_CFGR2 SPF           LL_SYSCFG_ClearFlag_SP
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_ClearFlag_SP(void)
{
  SET_BIT(SYSCFG->CFGR[1], SYSCFG_CFGR2_SPF);
}

/**
  * @}
  */

/** @defgroup SYSTEM_LL_EF_FLASH FLASH
  * @{
  */

/**
  * @brief  Set FLASH Latency
  * @rmtoll FLASH_ACR    LATENCY       LL_FLASH_SetLatency
  * @param  Latency This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_LATENCY_0
  *         @arg @ref LL_FLASH_LATENCY_1
  *         @arg @ref LL_FLASH_LATENCY_3
  *         @arg @ref LL_FLASH_LATENCY_4
  *         @arg @ref LL_FLASH_LATENCY_5
  *         @arg @ref LL_FLASH_LATENCY_6
  *         @arg @ref LL_FLASH_LATENCY_7
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_SetLatency(uint32_t Latency)
{
  MODIFY_REG(FLASH->ACR, FLASH_ACR_LATENCY, Latency);
}

